PGM PARM(&TARGET)
    DCL VAR(&TARGET) TYPE(*CHAR) LEN(32) VALUE('HELLO')
    CRTLIB LIB(DEMOCL)
    MONMSG MSGID(CPF0000) EXEC(SNDPGMMSG MSG('DEMOCL already exists or cannot be created'))
    ADDLIBLE LIB(DEMOCL)
    CHGCURLIB CURLIB(DEMOCL)
    IF COND(&TARGET *EQ 'HELLO') THEN(DO)
        CRTCLPGM PGM(DEMOCL/HELLO) SRCFILE(QGPL/QCLSRC) SRCMBR(HELLO.CLP)
        CALL PGM(DEMOCL/HELLO)
    ELSE
        SNDPGMMSG MSG('TARGET is not HELLO')
    ENDDO
ENDPGM
